app/controllers/api/v1/auth_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."email" = 'admin@example.com' LIMIT 1
---
  def login
    admin = Admin.where(email: params[:email]).first