app/controllers/api/v1/purchases_controller.rb

SELECT purchases.id, purchases.quantity, purchases.total_price, purchases.purchased_at, products.name AS product_name, clients.email AS client_email FROM "purchases" INNER JOIN "products" ON "products"."id" = "purchases"."product_id" INNER JOIN "product_categories" ON "product_categories"."product_id" = "products"."id" INNER JOIN "categories" ON "categories"."id" = "product_categories"."category_id" INNER JOIN "clients" ON "clients"."id" = "purchases"."client_id" WHERE (purchases.purchased_at >= '2024-01-01') AND (purchases.purchased_at <= '2024-01-31') AND (categories.id = '1')
---
  def index
    purchases = Purchase.joins(product: :categories)

SELECT DATE_TRUNC('day', purchases.purchased_at) AS period, COUNT(*) AS total_count FROM "purchases" INNER JOIN "products" ON "products"."id" = "purchases"."product_id" INNER JOIN "product_categories" ON "product_categories"."product_id" = "products"."id" INNER JOIN "categories" ON "categories"."id" = "product_categories"."category_id" WHERE (purchases.purchased_at >= '2024-01-01') AND (purchases.purchased_at <= '2024-01-31') GROUP BY DATE_TRUNC('day', purchases.purchased_at) ORDER BY period
---
  def count_by_granularity
    purchases = Purchase.joins(product: :categories)