app/controllers/api/v1/reports_controller.rb

    def top_products_by_category
      data = Category.joins(products: :purchases)
                     .select('categories.id AS category_id, categories.name AS category_name, products.id AS product_id, products.name AS product_name, SUM(purchases.quantity) AS total_sold')
                     .group('categories.id, products.id')
                     .order('categories.id, total_sold DESC')
---
SELECT categories.id AS category_id, categories.name AS category_name, products.id AS product_id, products.name AS product_name, SUM(purchases.quantity) AS total_sold FROM "categories" INNER JOIN "product_categories" ON "product_categories"."category_id" = "categories"."id" INNER JOIN "products" ON "products"."id" = "product_categories"."product_id" INNER JOIN "purchases" ON "purchases"."product_id" = "products"."id" GROUP BY categories.id, products.id ORDER BY categories.id, total_sold DESC

    def top_revenue_products_by_category
      data = Category.joins(products: :purchases)
                     .select('categories.id AS category_id, categories.name AS category_name, products.id AS product_id, products.name AS product_name, SUM(purchases.total_price) AS total_revenue')
                     .group('categories.id, products.id')
                     .order('categories.id, total_revenue DESC')
---
SELECT categories.id AS category_id, categories.name AS category_name, products.id AS product_id, products.name AS product_name, SUM(purchases.total_price) AS total_revenue FROM "categories" INNER JOIN "product_categories" ON "product_categories"."category_id" = "categories"."id" INNER JOIN "products" ON "products"."id" = "product_categories"."product_id" INNER JOIN "purchases" ON "purchases"."product_id" = "products"."id" GROUP BY categories.id, products.id ORDER BY categories.id, total_revenue DESC